In [7]:
%load_ext sql

In [8]:
%sql mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server

In [10]:
# SQL Practice Script: Basics
# âœ… Use this in VS Code with MS SQL extension

# 1. View all Employees
%sql SELECT * FROM Employees

 * mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(201, 'Ahmed', 'Khan', 1, 1, datetime.date(2020, 1, 10)),
 (202, 'Zara', 'Sheikh', 2, 2, datetime.date(2021, 5, 15)),
 (203, 'Imran', 'Ali', 3, 3, datetime.date(2019, 11, 1)),
 (204, 'Sana', 'Malik', 4, 4, datetime.date(2018, 6, 20)),
 (205, 'Ayesha', 'Qureshi', 1, 1, datetime.date(2022, 2, 1)),
 (207, 'Tariq', 'Zaman', 3, 3, datetime.date(2020, 7, 25)),
 (208, 'Tania', 'Agarwal', 2, 2, datetime.date(2022, 3, 1))]

In [12]:
# 2. View all Departments
%sql SELECT * FROM Departments

 * mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(1, 'IT'), (2, 'HR'), (3, 'Sales'), (4, 'Finance')]

In [13]:
 # 3. View all Designations
 %sql SELECT * FROM Designations

 * mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(1, 'Software Engineer'),
 (2, 'HR Executive'),
 (3, 'Sales Associate'),
 (4, 'Accountant')]

In [15]:
 # 4. View all Salaries
 %sql SELECT * FROM Salaries

 * mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(201, Decimal('60000.00'), Decimal('5000.00'), Decimal('2000.00'), Decimal('2500.00')),
 (202, Decimal('50000.00'), Decimal('4000.00'), Decimal('1500.00'), Decimal('1000.00')),
 (203, Decimal('45000.00'), Decimal('3000.00'), Decimal('1200.00'), Decimal('1000.00')),
 (204, Decimal('55000.00'), Decimal('3500.00'), Decimal('1700.00'), Decimal('1000.00')),
 (205, Decimal('50000.00'), Decimal('4000.00'), Decimal('1500.00'), Decimal('2500.00')),
 (207, Decimal('52000.00'), Decimal('3500.00'), Decimal('1200.00'), Decimal('1000.00')),
 (208, Decimal('48000.00'), Decimal('3000.00'), Decimal('1500.00'), Decimal('1000.00'))]

In [ ]:
# 5. Insert a new Employee
%sql INSERT INTO Employees (EmpID,FirstName,LastName ,DeptID , DesigID , JoinDate) 
VALUES (208 , 'Tania' , 'Agarwal' , 2,2, '2022-03-1');

In [ ]:
#6: Insert Salary for new Employee (208)
INSERT INTO Salaries (EmpID ,BasicSalary, Allowance,Deductions )
 VALUES(208, 48000,3000,1500);

In [ ]:
 # 7. Update an Employee's Designation
UPDATE Employees
 SET DesigID = 4
WHERE EmpID = 206;

In [ ]:
 # 8. Delete an Employee
DELETE FROM Salaries
WHERE EmpID = 206

In [ ]:
DELETE from Employees
WHERE EmpID = 206;

In [ ]:
# 9. Add a new column to Salaries table
ALTER TABLE Salaries
ADD Bonus DECIMAL(10,2)

In [ ]:
# 9. Update Bonus for an employee
UPDATE Salaries
SET Bonus = 2500
WHERE EmpID =205;

In [ ]:
# 10. Drop the Bonus column (If Needed)
ALTER TABLE salaries
DROP COLUMN Bonus;

# âœ… INTERMEDIATE LEVEL QUERIES (JOIN, GROUP BY, CASE)

In [ ]:
-- 11. Join Employees with Salaries
SELECT E.EmpID, FirstName, LastName, BasicSalary, Allowance
FROM Employees E
JOIN Salaries S ON E.EmpID = S.EmpID;

In [ ]:
# 12. Join Employees with Departments
%sql SELECT E.FirstName , E.LastName , D.DeptName
FROM Employees E
JOIN Departments D ON E.DeptID = D.DeptID

In [ ]:
# 13. Total Salary (Basic + Allowance) for each employee
%sql SELECT EmpID , (BasicSalary + Allowance) AS  TotalSalary
From salaries

In [33]:
# 14. Use CASE to show tax status
%sql SELECT EmpID, BasicSalary,  CASE WHEN BasicSalary > 5000 THEN 'Taxable' ELSE 'Non-Taxable' END AS TaxStatus FROM Salaries;

 * mssql+pyodbc://@localhost/PythonPracticeDB?driver=ODBC+Driver+17+for+SQL+Server
Done.

[(201, Decimal('60000.00'), 'Taxable'),
 (202, Decimal('50000.00'), 'Taxable'),
 (203, Decimal('45000.00'), 'Taxable'),
 (204, Decimal('55000.00'), 'Taxable'),
 (205, Decimal('50000.00'), 'Taxable'),
 (207, Decimal('52000.00'), 'Taxable'),
 (208, Decimal('48000.00'), 'Taxable')]

In [ ]:
# 15. Count employees in each department
%sqlSELECT DeptID, COUNT(*) AS TotalEmployees FROM Employees GROUP BY DeptID;

In [34]:
# 16. Average salary per department
%sql SELECT E.DeptID, AVG(S.BasicSalary) AS AvgSalary
FROM Employees E
JOIN Salaries S ON E.EmpID = S.EmpID
GROUP BY E.DeptID;

SyntaxError: invalid syntax (3390625354.py, line 3)

IndentationError: unexpected indent (3342720614.py, line 3)

UsageError: Line magic function `%sqlSELECT` not found.

In [ ]:



# 17. Employees who joined after 2022
%sql SELECT * FROM Employees
WHERE JoinDate > '2022-01-01';

# 18. Get top 3 highest salaries
%sql SELECT TOP 3 EmpID, BasicSalary
FROM Salaries
ORDER BY BasicSalary DESC;

# 19. Employees without salary records
%sql SELECT *
FROM Employees
WHERE EmpID NOT IN (%sql SELECT EmpID FROM Salaries);

# 20. Show full name and total salary
%sql SELECT FirstName + ' ' + LastName AS FullName,
       (BasicSalary + Allowance - ISNULL(Deductions, 0)) AS NetSalary
FROM Employees E
JOIN Salaries S ON E.EmpID = S.EmpID;

# âœ… You're now practicing %sql SELECT, INSERT, UPDATE, DELETE, ALTER, JOIN, GROUP BY, CASE
%sql SELECT EmpID, Bonus FROM Salaries;

%sql SELECT COLUMN_NAME 
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_NAME = 'Salaries';

UPDATE Salaries
SET Bonus = 2500
WHERE EmpID = 201;

UPDATE Salaries
SET Bonus = 1000
WHERE Bonus IS NULL;